import { Content } from "@/types";

export const ru: Content = {
  hero: {
    name: "Ник Дашевски",
    tag1: "/ Бекенд, веб3, ИИ",
    tag1line2: "& фин. сервисы",
    tag1sub1: "Архитектура продукта и технической",
    tag1sub2: "реализации, енд-ту-енд разработка",
    tag2line1: "/ Продукт-директор",
    tag2line2: "& разработчик",
    tag2sub1: "Руковожу командами, работаю",
    tag2sub2: "с инвесторами, развиваю продукты",
  },
  contact1: {
    text: "Я всегда за любой коннект, поэтому пишите",
    button: "{клик для связи}",
  },
  about: {
    title: "ИНФА",
    cvButton: "{клик открыть CV}",
    cvUrl: "#", // TODO: ссылка на CV
    text: [
      `/* C 2017 управляю айти & диджитал проектами, с 2021 занимаюсь разработкой: бекенд, ИИ, веб3 и финансовые сервисы. 

Я тот самый разработчик с бизнес мозгами. Поэтому, вместе, мы можем сделать что-то крутое 
------------- и заработать много денег. */`,
    ],
  },
  examples: {
    title: "примеры",
    viewButton: "{клик открыть}",
    cases: [
      {
        id: "01",
        color: "#6cad5e",
        name: "*** Соло сделал честную PvP-игру на крипте: как казино, но без казино ***",
        tags: "",
      },
      {
        id: "02",
        color: "#9a38af",
        name: "*** Собрал команду и разработал биржу для создания и торговли токенизированными активами ***",
        tags: "",
      },
    ],
  },
  services: {
    title: "Что могу",
    items: [
      "\u00A0\u00A0Быстро создать и запустить МВП",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Разработать продукт — сам / с командой",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Руководить вашим айти и диджтал штатом",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Продать идею & продукт инвесторам",
    ],
  },
  contact2: {
    line1: "Я всегда за любой коннект,",
    line2: "поэтому пишите",
    button: "{клик для связи}",
    marquee: `знаете тех, кто ищет разработчиков? Порекомендуйте меня, заплачу щедрую комиссию`,
  },
  footer: {
    email: "nikitadashewski@gmail.com",
    team: "telegram link",
    teamUrl: "https://t.me/dashewski",
    github: "gitHub link",
    githubUrl: "https://github.com/dashewski/",
  },
  mobile: {
    contact2lines: {
      line1: "всегда за любой коннект,",
      line2: "поэтому пишите",
    },
    about: {
      text: [
        `/* C 2017 управляю айти & диджитал проектами, с 2021 занимаюсь разработкой: бекенд, ИИ, веб3 и финансовые сервисы.`,
        ``,
        `Я тот самый разработчик 
        с бизнес мозгами. Поэтому, вместе, мы сможем сделать что-то крутое`,
        `
        --------- и заработать много денег. */`,
      ],
    },
    services: {
      items: [
        "Быстро создать и запустить МВП",
        "Разработать продукт — сам / с командой",
        "Руководить вашим айти и диджтал штатом",
        "Продать идею & продукт инвесторам ",
      ],
    },
  },
};
