import { Content } from "@/types";

export const ru: Content = {
  hero: {
    name: "Ник Дашевски",
    tag1: "/ Бекенд, фин. сервисы & ai",
    tag1sub1: "Архитектура продукта и технической",
    tag1sub2: "реализации, end-to-end разработка",
    tag2line1: "/ Product-директор",
    tag2line2: "$ разработчик",
    tag2sub1: "Руковожу командами и подрядчиками, работаю",
    tag2sub2: "с инвесторами, довожу идеи до продукта",
  },
  contact1: {
    text: "Я всегда за любой коннект, поэтому пишите",
    button: "{клик для связи}",
  },
  about: {
    title: "ИНФА",
    text: [
      `/* C 2017 управляю IT / digital проектами,      с 2020 занимаюсь разработкой:        backend, ai, web3 и финансовые сервисы. 

Я тот самый разработчик    
                   с бизнес мозгами.         поэтому, вместе, мы можем сделать что-то крутое                        --------- и заработать много денег. */`,
    ],
  },
  examples: {
    title: "примеры",
    viewButton: "{клик открыть}",
    cases: [
      {
        id: "01",
        color: "#6cad5e",
        name: "*** Соло сделал честную PvP крипто-игру, как казино, но без казино ***",
        tags: "соло-дев, бекенд, смарт-контракты, дизайн, tgminapp",
      },
      {
        id: "02",
        color: "#9a38af",
        name: "*** Собрал команду, сделали платформу для токенизации бизнеса и торговли RWA-активами ***",
        tags: "тим-лидинг, смарт-контракты, DeFi, бекенд, дизайн",
      },
    ],
  },
  services: {
    title: "Что могу",
    items: [
      "\u00A0\u00A0Быстро создать и запустить MVP",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Разработать продукт — сам / с командой",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Руководить вашим IT и digital штатом",
      "\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0Продать идею & продукт инвесторам",
    ],
  },
  contact2: {
    line1: "Я всегда за любой коннект,",
    line2: "поэтому пишите",
    button: "{клик для связи}",
    marquee: `знаете тех, кто ищет разработчиков? Порекомендуйте меня, заплачу щедрую комиссию`,
  },
  footer: {
    email: "nikitadashewski@gmail.com",
    team: "telegram link",
    teamUrl: "https://t.me/dashewski",
    github: "gitHub link",
    githubUrl: "https://github.com/dashewski/",
  },
  mobile: {
    contact2lines: {
      line1: "всегда за любой коннект,",
      line2: "поэтому пишите",
    },
    about: {
      text: [
        `/* C 2017 управляю IT / digital проектами,      с 2020 занимаюсь разработкой:      backend, ai, web3 и финансовые сервисы.`,
        ``,
        `Я тот самый разработчик с`,
        `        бизнес мозгами. поэтому, вместе, мы можем сделать что-то крутое`,
        `--------- и заработать много денег. */`,
      ],
    },
    services: {
      items: [
        "Быстро создать и запустить MVP",
        "Разработать продукт — сам / с командой",
        "Руководить вашим IT и digital штатом",
        "Продать идею & продукт инвесторам ",
      ],
    },
  },
};
